0/include/initialConditions
pressure        0;
flowVelocity    (0 0 0);
turbulentKE     0.1;
turbulentOmega  10;
