0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet  { type calculated; value uniform 0; }
    outlet { type calculated; value uniform 0; }
    left   { type nutkWallFunction; value uniform 0; }
    right  { type nutkWallFunction; value uniform 0; }
    front  { type nutkWallFunction; value uniform 0; }
    back   { type nutkWallFunction; value uniform 0; }
    fan    { type nutkWallFunction; value uniform 0; }
}
