0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    left  { type zeroGradient; }
    right { type zeroGradient; }
    front { type zeroGradient; }
    back  { type zeroGradient; }
    fan   { type zeroGradient; }
}
