system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-1.8 -1.8 -0.9)
    ( 1.8 -1.8 -0.9)
    ( 1.8  1.8 -0.9)
    (-1.8  1.8 -0.9)

    (-1.8 -1.8  1.8)
    ( 1.8 -1.8  1.8)
    ( 1.8  1.8  1.8)
    (-1.8  1.8  1.8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (100 100 80)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    front
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    back
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);